In [120]:
import numpy as np
import pandas as pd

In [121]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [122]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [123]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [124]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [125]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Dates

In [126]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [127]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1. Extract year

In [128]:
date['date_year'] = date['date'].dt.year

date.sample(5)

          date  product_id  city_id  orders  date_year
814 2019-06-13        6438       24       8       2019
76  2019-04-18        5973       16       1       2019
526 2018-09-29        6671       20      15       2018
404 2019-07-12         841        0       2       2019
885 2019-07-03        7368       25       1       2019

#### 2. Extract Month

In [129]:
date['date_month_no'] = date['date'].dt.month

date.head()

        date  product_id  city_id  orders  date_year  date_month_no
0 2019-12-10        5628       25       3       2019             12
1 2018-08-15        3646       14     157       2018              8
2 2018-10-23        1859       25       1       2018             10
3 2019-08-17        7292       25       1       2019              8
4 2019-01-06        4344       25       3       2019              1

In [130]:
date['date_month_name'] = date['date'].dt.month_name()

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

#### Extract Days

In [131]:
date['date_day'] = date['date'].dt.day

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [132]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [133]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [134]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

#### Extract week of the year

In [135]:
date['date_week'] = date['date'].dt.day_of_week

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1
3,2019-08-17,2019,8,August,17,5,Saturday,1,5
4,2019-01-06,2019,1,January,6,6,Sunday,1,6

#### Extract Quarter

In [136]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,5,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,6,1

#### Extract Semester

In [137]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,5,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,6,1,1

#### Extract Time elapsed between dates

In [138]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 11, 27, 7, 1, 19, 602035)

In [139]:
today - date['date']

0     2179 days 07:01:19.602035
1     2661 days 07:01:19.602035
2     2592 days 07:01:19.602035
3     2294 days 07:01:19.602035
4     2517 days 07:01:19.602035
                 ...
995   2607 days 07:01:19.602035
996   2548 days 07:01:19.602035
997   2396 days 07:01:19.602035
998   2461 days 07:01:19.602035
999   2235 days 07:01:19.602035
Name: date, Length: 1000, dtype: timedelta64[ns]

In [140]:
(today - date['date']).dt.days

0      2179
1      2661
2      2592
3      2294
4      2517
       ...
995    2607
996    2548
997    2396
998    2461
999    2235
Name: date, Length: 1000, dtype: int64

In [141]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'W'),0)

0      311.0
1      380.0
2      370.0
3      328.0
4      360.0
       ...
995    372.0
996    364.0
997    342.0
998    352.0
999    319.0
Name: date, Length: 1000, dtype: float64

In [142]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [143]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [144]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [145]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

#### Extract Time part

In [146]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

#### Time difference

In [147]:
today - time['date']

0     4365 days 06:11:19.602035
1     4229 days 07:21:19.602035
2     4715 days 06:40:19.602035
3     4017 days 06:30:19.602035
4     4414 days 07:50:19.602035
                 ...
995   5004 days 06:11:19.602035
996   4325 days 07:47:19.602035
997   4790 days 07:24:19.602035
998   4906 days 07:27:19.602035
999   4178 days 07:36:19.602035
Name: date, Length: 1000, dtype: timedelta64[ns]

In [148]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.771583e+08
1      3.654121e+08
2      4.074000e+08
3      3.470922e+08
4      3.813978e+08
           ...
995    4.323679e+08
996    3.737080e+08
997    4.138827e+08
998    4.239052e+08
999    3.610066e+08
Name: date, Length: 1000, dtype: float64

In [149]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.285971e+06
1      6.090201e+06
2      6.790000e+06
3      5.784870e+06
4      6.356630e+06
           ...
995    7.206131e+06
996    6.228467e+06
997    6.898044e+06
998    7.065087e+06
999    6.016776e+06
Name: date, Length: 1000, dtype: float64

In [150]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      104766.188778
1      101503.355445
2      113166.672112
3       96414.505445
4      105943.838778
           ...
995    120102.188778
996    103807.788778
997    114967.405445
998    117751.455445
999    100279.605445
Name: date, Length: 1000, dtype: float64

In [151]:
from datetime import datetime

In [152]:
date.combine, time.columns

(<bound method DataFrame.combine of           date  product_id  city_id  orders  date_year  date_month_no  \
 0   2019-12-10        5628       25       3       2019             12
 1   2018-08-15        3646       14     157       2018              8
 2   2018-10-23        1859       25       1       2018             10
 3   2019-08-17        7292       25       1       2019              8
 4   2019-01-06        4344       25       3       2019              1
 ..         ...         ...      ...     ...        ...            ...
 995 2018-10-08         255       13       1       2018             10
 996 2018-12-06        5521        7       1       2018             12
 997 2019-05-07         487       26      14       2019              5
 998 2019-03-03        1503       21       2       2019              3
 999 2019-10-15        6371        7      22       2019             10

     date_month_name  date_day  date_dow date_dow_name  date_is_weekend  \
 0          December        10         1       Tuesday                0
 1            August        15         2     Wednesday                0
 2           October        23         1       Tuesday                0
 3            August        17         5      Saturday                1
 4           January         6         6        Sunday                1
 ..              ...       ...       ...           ...              ...
 995         October         8         0        Monday                0
 996        December         6         3      Thursday                0
 997             May         7         1       Tuesday                0
 998           March         3         6        Sunday                1
 999         October        15         1       Tuesday                0

      date_week  quarter  semester
 0            1        4         2
 1            2        3         2
 2            1        4         2
 3            5        3         2
 4            6        1         1
 ..         ...      ...       ...
 995          0        4         2
 996          3        4         2
 997          1        2         1
 998          6        1         1
 999          1        4         2

 [1000 rows x 14 columns]>,
 Index(['date', 'msg', 'hour', 'min', 'sec', 'time'], dtype='object'))

In [163]:
date = '2025-11-27'
date_object = datetime.strptime(date, "%Y-%m-%d")
date = date_object.strftime("%d-%m-%Y")
date

'27-11-2025'